# 1. Создать список и заполнить его элементами различных типов данных.
# Реализовать скрипт проверки типа данных каждого элемента.
# Использовать функцию type() для проверки типа.
# Элементы списка можно не запрашивать у пользователя, а указать явно, в программе.
alfa = 2
my_zero_list = [1, 2, 3]
my_first_list = [1, "Fluid", None, False]
print("Типы данных из моего первого листа:", type(my_first_list[0]), type(my_first_list[1]), type(my_first_list[2]))
print(my_first_list.count("Fluid"))  # Принт номера по имени.

